tap "caskroom/fonts"
tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "jesseduffield/lazygit"
# Search tool like grep, but optimized for programmers
brew "ack"
# Java build tool
brew "ant"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# Generate and apply patches to binary files
brew "bsdiff"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Tools to work with Android .dex and Java .class files
brew "dex2jar"
# Dex to Java decompiler
brew "jadx"
# Colored logcat script to show entries only for specified app
brew "pidcat"
# Manage compile and link flags for libraries
brew "pkg-config"
# Web caching proxy
brew "polipo"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Display and control your Android device
brew "scrcpy"
# Assembler/disassembler for Android's Java VM implementation
brew "smali"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# UNIX shell (command interpreter)
brew "zsh"
# The Dart SDK
brew "dart-lang/dart/dart"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
cask "insomnia"
cask "caskroom/fonts/font-dejavusansmono-nerd-font"
cask "caskroom/fonts/font-firacode-nerd-font"
cask "caskroom/fonts/font-hack-nerd-font"
cask "caskroom/fonts/font-inconsolata-nerd-font"
cask "caskroom/fonts/font-meslo-nerd-font"
